### Total: 14



2016
- 11

2020
- 3

# 2016
1. simone biles (USA) 	
2. maria paseka (RUS) 
3. giulia steingruber (SUI)

# 2020
1. rebeca andrade (BRA) - no comps	
2. mykayla skinner (USA) - no comps	
3. yeo seo-jeong (KOR)

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('vt_w.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1627 entries, 0 to 1626
Data columns (total 14 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Rank     1627 non-null   float64
 1   Athlete  1627 non-null   object
 2   Nation   1627 non-null   object
 3   D        1627 non-null   float64
 4   E        1627 non-null   float64
 5   ND       1627 non-null   float64
 6   Total    1627 non-null   float64
 7   D2       1627 non-null   float64
 8   E2       1627 non-null   float64
 9   ND2      1627 non-null   float64
 10  Total2   1627 non-null   float64
 11  Average  1627 non-null   float64
 12  year     1627 non-null   float64
 13  round    1627 non-null   object
dtypes: float64(11), object(3)
memory usage: 178.1+ KB

In [4]:
df['Athlete'] = df['Athlete'].str.lower()

In [5]:
df = df.rename(columns={'Athlete': 'Name'})

In [6]:
df16 = df[df['year'].isin([2013, 2014, 2015, 2016])].copy()
df20 = df[df['year'].isin([2017, 2018, 2019, 2020])].copy()
df24 = df[df['year'].isin([2022, 2023])].copy()

In [7]:
# # Define a function to assign medal values based on the "Name" column
# def assign_medal(name):
#     name_lower = name.lower()
#     if name_lower == 'simone biles':
#         return 3
#     elif name_lower == 'maria paseka':
#         return 2
#     elif name_lower == 'giulia steingruber':
#         return 1
#     else:
#         return 0

# # Apply the function to create the "medal" column
# df16['medal'] = df16['Name'].apply(assign_medal)

In [8]:
# Define a function to assign medal values based on the "Name" column
def assign_medal(name):
    name_lower = name.lower()
    if name_lower == 'simone biles':
        return 1
    elif name_lower == 'maria paseka':
        return 1
    elif name_lower == 'giulia steingruber':
        return 1
    else:
        return 0

# Apply the function to create the "medal" column
df16['medal'] = df16['Name'].apply(assign_medal)

In [9]:
df16['medal'].value_counts()

medal
0    78
1    11
Name: count, dtype: int64

In [10]:
df16[df16["Name"]=="simone biles"]

,Rank,Name,Nation,D,E,ND,Total,D2,E2,ND2,Total2,Average,year,round,medal
43,1.0,simone biles,USA,6.3,9.600,0.0,15.900,5.6,9.550,0.0,15.150,15.525,2015.0,final,1
1523,2.0,simone biles,USA,6.3,9.633,0.0,15.933,5.6,9.658,0.0,15.258,15.595,2013.0,final,1
1531,2.0,simone biles,USA,6.3,9.600,0.0,15.900,5.6,9.608,0.0,15.208,15.554,2014.0,final,1
1540,3.0,simone biles,USA,6.3,9.600,0.0,15.900,5.6,9.583,0.0,15.183,15.541,2015.0,final,1

In [11]:
df16[df16["Name"]=="maria paseka"]

,Rank,Name,Nation,D,E,ND,Total,D2,E2,ND2,Total2,Average,year,round,medal
1538,1.0,maria paseka,RUS,6.4,9.233,0.0,15.633,6.3,9.4,0.0,15.7,15.666,2015.0,final,1
1611,1.0,maria paseka,RUS,6.3,9.100,0.0,15.400,5.6,8.8,-0.3,14.1,14.750,2015.0,final,1
1619,1.0,maria paseka,RUS,6.4,8.700,0.0,15.100,6.3,9.1,0.0,15.4,15.250,2015.0,final,1

In [12]:
df16[df16["Name"]=="giulia steingruber"]

,Rank,Name,Nation,D,E,ND,Total,D2,E2,ND2,Total2,Average,year,round,medal
1525,4.0,giulia steingruber,SUI,6.2,9.300,0.0,15.500,5.8,9.166,0.0,14.966,15.233,2013.0,final,1
1534,5.0,giulia steingruber,SUI,6.2,9.033,0.0,15.233,5.0,9.200,0.0,14.200,14.716,2014.0,final,1
1544,7.0,giulia steingruber,SUI,6.2,9.400,-0.1,15.500,5.3,8.333,0.0,13.633,14.566,2015.0,final,1
1620,2.0,giulia steingruber,SUI,6.2,9.133,0.0,15.333,5.8,9.166,0.0,14.966,15.149,2015.0,final,1

In [13]:

#     rebeca andrade (BRA)
#     mykayla skinner (USA)
#     yeo seo-jeong (KOR)

In [14]:
# # Define a function to assign medal values based on the "Name" column
# def assign_medal(name):
#     name_lower = name.lower()
#     if name_lower == 'rebeca andrade':
#         return 3
#     elif name_lower == 'mykayla skinner':
#         return 2
#     elif name_lower == 'yeo seo-jeong':
#         return 1
#     else:
#         return 0

# # Apply the function to create the "medal" column
# df20['medal'] = df20['Name'].apply(assign_medal)

In [15]:
# Define a function to assign medal values based on the "Name" column
def assign_medal(name):
    name_lower = name.lower()
    if name_lower == 'rebeca andrade':
        return 1
    elif name_lower == 'mykayla skinner':
        return 1
    elif name_lower == 'yeo seo-jeong':
        return 1
    else:
        return 0

# Apply the function to create the "medal" column
df20['medal'] = df20['Name'].apply(assign_medal)

In [16]:
df20['medal'].value_counts()

medal
0    53
1     3
Name: count, dtype: int64

In [17]:
df20[df20['Name']=='rebeca andrade']

Empty DataFrame
Columns: [Rank, Name, Nation, D, E, ND, Total, D2, E2, ND2, Total2, Average, year, round, medal]
Index: []

In [18]:
df20[df20['Name']=='mykayla skinner']

Empty DataFrame
Columns: [Rank, Name, Nation, D, E, ND, Total, D2, E2, ND2, Total2, Average, year, round, medal]
Index: []

In [19]:
df20[df20['Name']=='yeo seo-jeong']

,Rank,Name,Nation,D,E,ND,Total,D2,E2,ND2,Total2,Average,year,round,medal
7,1.0,yeo seo-jeong,KOR,5.8,8.666,0.0,14.466,5.4,8.666,0.0,14.066,14.266,2019.0,final,1
1555,5.0,yeo seo-jeong,none,5.8,8.833,0.1,14.533,5.4,8.533,0.0,13.933,14.233,2018.0,final,1
1566,8.0,yeo seo-jeong,none,6.2,8.033,0.3,13.933,5.4,9.033,0.0,14.433,14.183,2019.0,final,1

In [20]:
combined_df = pd.concat([df20, df16], axis=0)
df = combined_df.copy()

In [21]:
df['medal'].value_counts()

medal
0    131
1     14
Name: count, dtype: int64

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 145 entries, 0 to 1626
Data columns (total 15 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Rank     145 non-null    float64
 1   Name     145 non-null    object
 2   Nation   145 non-null    object
 3   D        145 non-null    float64
 4   E        145 non-null    float64
 5   ND       145 non-null    float64
 6   Total    145 non-null    float64
 7   D2       145 non-null    float64
 8   E2       145 non-null    float64
 9   ND2      145 non-null    float64
 10  Total2   145 non-null    float64
 11  Average  145 non-null    float64
 12  year     145 non-null    float64
 13  round    145 non-null    object
 14  medal    145 non-null    int64
dtypes: float64(11), int64(1), object(3)
memory usage: 18.1+ KB

In [23]:
df.nunique()

Rank         8
Name        83
Nation      39
D           17
E           72
ND           5
Total       93
D2          19
E2          61
ND2          6
Total2      82
Average    113
year         8
round        2
medal        2
dtype: int64

In [24]:
df['round'] = df['round'].str.lower()

In [25]:
from sklearn.preprocessing import LabelEncoder

# Assuming df is your DataFrame and 'Name' is the column you want to encode
le = LabelEncoder()

# Fit and transform the 'Name' column to create integer labels
df['Name_encoded'] = le.fit_transform(df['Name'])

# Store the mapping between integers and original objects
label_mapping = dict(zip(le.transform(df['Name']), df['Name']))

# To revert the integers back to objects, use the label_mapping
# reverted_names = df['Name_encoded'].map(label_mapping)

In [26]:
df=df.drop(columns=["Name"])
df.rename(columns={'Name_encoded': 'Name'}, inplace=True)

In [27]:
from sklearn.preprocessing import LabelEncoder

# Assuming df is your DataFrame and 'Name' is the column you want to encode
le = LabelEncoder()

# Fit and transform the 'Name' column to create integer labels
df['nation_encoded'] = le.fit_transform(df['Nation'])

# Store the mapping between integers and original objects
label_mapping_nation = dict(zip(le.transform(df['Nation']), df['Nation']))

# To revert the integers back to objects, use the label_mapping
# reverted_names = df['Name_encoded'].map(label_mapping)

In [28]:
df=df.drop(columns=["Nation"])
df.rename(columns={'nation_encoded': 'Nation'}, inplace=True)

In [29]:
df_encoded = pd.get_dummies(df, columns=['round'], prefix='round')

In [30]:
df_encoded.info()

<class 'pandas.core.frame.DataFrame'>
Index: 145 entries, 0 to 1626
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Rank         145 non-null    float64
 1   D            145 non-null    float64
 2   E            145 non-null    float64
 3   ND           145 non-null    float64
 4   Total        145 non-null    float64
 5   D2           145 non-null    float64
 6   E2           145 non-null    float64
 7   ND2          145 non-null    float64
 8   Total2       145 non-null    float64
 9   Average      145 non-null    float64
 10  year         145 non-null    float64
 11  medal        145 non-null    int64
 12  Name         145 non-null    int64
 13  Nation       145 non-null    int64
 14  round_2015   145 non-null    bool
 15  round_final  145 non-null    bool
dtypes: bool(2), float64(11), int64(3)
memory usage: 17.3 KB

In [31]:
correlations = df_encoded.corrwith(df['medal'])

correlations.sort_values(ascending=False)

medal          1.000000
Total          0.433392
D              0.405137
Average        0.290484
E              0.240838
Nation         0.223166
Name           0.187326
D2             0.166492
Total2         0.160278
E2             0.149456
ND             0.094747
round_final    0.078997
ND2            0.008550
round_2015    -0.078997
year          -0.105722
Rank          -0.181674
dtype: float64

In [32]:
# medal 0 or 1
# medal          1.000000
# Total          0.433392
# D              0.405137
# Average        0.290484
# E              0.240838
# Nation         0.223166
# Name           0.187326
# D2             0.166492
# Total2         0.160278
# E2             0.149456
# ND             0.094747
# round_final    0.078997
# ND2            0.008550
# round_2015    -0.078997
# year          -0.105722
# Rank          -0.181674
# dtype: float64

In [33]:
# # medal 3,2,1,0
# medal          1.000000
# Total          0.463714
# D              0.387158
# Average        0.312243
# E              0.304129
# Nation         0.205074
# Name           0.204034
# D2             0.156780
# Total2         0.156262
# E2             0.149686
# round_final    0.070466
# ND             0.052483
# ND2            0.003522
# round_2015    -0.070466
# year          -0.146415
# Rank          -0.239848
# dtype: float64

In [35]:
# df_encoded.to_csv('vt_encoded.csv', index=False)